# PreferPatternAlignUiFilter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PreferPatternAlignUiFilter Property
ParameterTypeId Class See Also
---
"Pattern:": This is used by the UI to allow to select the preferred preference of aligning pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PreferPatternAlignUiFilter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PreferPatternAlignUiFilter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PreferPatternAlignUiFilter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace